Tekla Open API Reference for Tekla Structures 2025
MarkBaseAttributes Constructor
Overload List
Name | Description
MarkBase.MarkBaseAttributes()
 Creates a new default mark base attributes instance that loads standard attributes.
MarkBase.MarkBaseAttributes(String)
 Creates a new mark base attributes instance with the given attributes file's filename.
Top
See Also
Reference
MarkBase.MarkBaseAttributes Class
Tekla.Structures.Drawing Namespace